{"backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"trainable": true, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "batch_input_shape": [null, 3, 8], "name": "lstm_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "activation": "tanh", "recurrent_dropout": 0.0, "unit_forget_bias": true, "recurrent_regularizer": null, "activity_regularizer": null, "recurrent_constraint": null, "dtype": "float32", "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "return_sequences": false, "bias_constraint": null, "unroll": false, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "return_state": false, "use_bias": true, "stateful": false, "dropout": 0.0}}, {"class_name": "RepeatVector", "config": {"trainable": true, "name": "repeat_vector_2", "n": 2}}, {"class_name": "LSTM", "config": {"trainable": true, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "name": "lstm_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "activation": "tanh", "recurrent_dropout": 0.0, "unit_forget_bias": true, "recurrent_regularizer": null, "activity_regularizer": null, "recurrent_constraint": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "return_sequences": true, "bias_constraint": null, "unroll": false, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "return_state": false, "use_bias": true, "stateful": false, "dropout": 0.4}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_2", "layer": {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "softmax", "bias_constraint": null, "activity_regularizer": null, "use_bias": true}}}}], "keras_version": "2.0.6", "class_name": "Sequential"}